# Pandas

Python library for data analysis and manipulation

Two main data structures
- 1D Series (list)
- 2D DataFrame (matrix)

Why ?
- Support for CSV, Excel, SQL, JSON etc
- Powerful data aggregation and grouping
- Easy handling of missing
- Convenient for filtering, joining, and reshaping

In [6]:
import numpy as np
import pandas as pd

In [3]:
friends = {
    'name': ['Nitin', 'Shyam', 'Pavan'],
    'city': ['Bangalore', 'Delhi', 'Vishakha'],
    'marks': [98, 99, 95]
}

In [4]:
friends

{'name': ['Nitin', 'Shyam', 'Pavan'],
 'city': ['Bangalore', 'Delhi', 'Vishakha'],
 'marks': [98, 99, 95]}

In [5]:
# Create dataframe
df = pd.DataFrame(friends)
df

    name       city  marks
0  Nitin  Bangalore     98
1  Shyam      Delhi     99
2  Pavan   Vishakha     95

In [7]:
# Saving dataframe to files
df.to_csv('friends.csv')

In [8]:
# Saving dataframe to files without index
df.to_csv('friends.csv', index=False)

In [9]:
# Top of dataframe
df.head()

    name       city  marks
0  Nitin  Bangalore     98
1  Shyam      Delhi     99
2  Pavan   Vishakha     95

In [10]:
df.head(2)

    name       city  marks
0  Nitin  Bangalore     98
1  Shyam      Delhi     99

In [11]:
# Last of dataframe
df.tail(2)

    name      city  marks
1  Shyam     Delhi     99
2  Pavan  Vishakha     95

In [12]:
df.describe()

           marks
count   3.000000
mean   97.333333
std     2.081666
min    95.000000
25%    96.500000
50%    98.000000
75%    98.500000
max    99.000000

In [13]:
df.describe(include=object)

         name       city
count       3          3
unique      3          3
top     Nitin  Bangalore
freq        1          1

In [20]:
# Read a csv file
friendsRead = pd.read_csv('friends-read.csv')

In [21]:
friendsRead

     name       city  marks
0   Nitin  Bangalore     98
1   Shyam      Delhi     99
2   PAVAN   Vishakha    100
3  Anjali     Mumbai     95
4    Ravi    Chennai     88
5   Meena  Hyderabad     92
6    Aman       Pune     85
7   Sneha    Kolkata     93
8     Raj  Ahmedabad     90
9   Divya     Jaipur     97

In [22]:
friendsRead.describe()

           marks
count   10.00000
mean    93.70000
std      4.98999
min     85.00000
25%     90.50000
50%     94.00000
75%     97.75000
max    100.00000

In [23]:
# Access values - [col][row]
friendsRead['name']

0     Nitin
1     Shyam
2     PAVAN
3    Anjali
4      Ravi
5     Meena
6      Aman
7     Sneha
8       Raj
9     Divya
Name: name, dtype: object

In [24]:
friendsRead['name'][3]

'Anjali'

In [25]:
friendsRead['name'][3] = 'Anjalika'

/var/folders/yv/_ddlvjkn6k11_jp7sl8jcy500000gn/T/ipykernel_61474/318388422.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  friendsRead['name'][3] = 'Anjalika'

In [26]:
friendsRead['name'][3]

'Anjalika'

In [29]:
friendsRead.to_csv('friends-read.csv', index=False)

In [28]:
friendsRead

       name       city  marks
0     Nitin  Bangalore     98
1     Shyam      Delhi     99
2     PAVAN   Vishakha    100
3  Anjalika     Mumbai     95
4      Ravi    Chennai     88
5     Meena  Hyderabad     92
6      Aman       Pune     85
7     Sneha    Kolkata     93
8       Raj  Ahmedabad     90
9     Divya     Jaipur     97

In [30]:
friendsRead.index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j',]

In [31]:
friendsRead

       name       city  marks
a     Nitin  Bangalore     98
b     Shyam      Delhi     99
c     PAVAN   Vishakha    100
d  Anjalika     Mumbai     95
e      Ravi    Chennai     88
f     Meena  Hyderabad     92
g      Aman       Pune     85
h     Sneha    Kolkata     93
i       Raj  Ahmedabad     90
j     Divya     Jaipur     97

In [33]:
friendsRead.to_csv('friends-read.csv')

### Series Data Structure

In [35]:
sr = pd.Series([1,2,3,4,5])
sr

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [36]:
type(sr)

pandas.core.series.Series

In [37]:
type(friendsRead)

pandas.core.frame.DataFrame

In [41]:
# random series
randomSr = pd.Series( np.random.randint(1,10, size=10) )
randomSr

0    3
1    2
2    9
3    7
4    3
5    2
6    6
7    5
8    8
9    7
dtype: int64

In [42]:
randomDf = pd.DataFrame(np.random.randint(1,101, size=(5,5)))
randomDf

    0   1   2   3   4
0  60   3  24   5  10
1   1  74  77  56  62
2  92  65  10  70  31
3  13  79  91  11  85
4  34  65  18  71  25

In [44]:
randomDf.describe()

              0          1          2          3          4
count   5.00000   5.000000   5.000000   5.000000   5.000000
mean   40.00000  57.200000  44.000000  42.600000  42.600000
std    36.70831  30.890128  37.181985  32.207142  30.336447
min     1.00000   3.000000  10.000000   5.000000  10.000000
25%    13.00000  65.000000  18.000000  11.000000  25.000000
50%    34.00000  65.000000  24.000000  56.000000  31.000000
75%    60.00000  74.000000  77.000000  70.000000  62.000000
max    92.00000  79.000000  91.000000  71.000000  85.000000

In [17]:
randomDf1 = pd.DataFrame(np.random.randint(1,101, size=(200,5)))
randomDf1.head()

    0    1   2   3   4
0  52  100  52  28  25
1  47   70   9  77  37
2  82   96  19  95  20
3  96   45  71  73  98
4  55   19  81  88  85

In [18]:
randomDf1.head()

    0    1   2   3   4
0  52  100  52  28  25
1  47   70   9  77  37
2  82   96  19  95  20
3  96   45  71  73  98
4  55   19  81  88  85

In [19]:
randomDf1.tail()

      0   1   2   3   4
195  74  61  57  38  29
196  49  40  26  67  78
197  99  94  42  82  55
198  58  69  17   9  45
199  31  95  16   7  27

In [50]:
randomDf1.index

RangeIndex(start=0, stop=200, step=1)

In [51]:
randomDf1.columns

RangeIndex(start=0, stop=5, step=1)

In [52]:
randomDf1.to_numpy()

array([[ 30,  78,  49,  46,  66],
       [ 48,  46,   7,  95,  75],
       [ 42,  52,  33,  47,  21],
       [ 78,  53,  90,   7,  43],
       [ 77,  79,  57,  74,  50],
       [  1,  52,  62,  29,  42],
       [ 59,  34,  87,  44,  80],
       [ 84,  31,  56,  78,  90],
       [ 85,  15,  25,  99,  97],
       [ 56,  99,  51,  25,  88],
       [ 68,  71,  14,  22,  74],
       [ 43,  34,  72,  38,  25],
       [ 66,  87,  65,  19,  92],
       [ 21,  21,  38,  57,  54],
       [  3,  27,  68,  96,  40],
       [ 10,  73,  62,  74,  48],
       [  2,  21,  71,  77,  84],
       [ 64,  15,  29,  83,  29],
       [ 90,  28,  59,  45,  41],
       [ 75,  50,  54,  81,  31],
       [ 31,  36,  46,  58,  60],
       [ 89,  65,  72,  88,  64],
       [ 82,  53,   8,   4,  19],
       [ 47,  68,  24,  38,  55],
       [ 54,  24,  38,  43,  17],
       [ 62,  67,  35,  36,  30],
       [ 64,  81,  87,  47,  94],
       [ 24,  65,   9,  43,  27],
       [ 14,  22,  79,  92,  17],
       [ 46,  17,  31,  72,  63],
       [ 53, 100, 100,  99,  75],
       [ 31,  74,   7,  80,  74],
       [ 13,  88,  64,  60,   6],
       [ 38,  35,  81,  65,  30],
       [ 54,  60,  63,  90,  98],
       [ 13,   9,  85,  55,  21],
       [ 28,  90,   2,  26,  12],
       [ 30,  97,  37,  57,  76],
       [ 35,  10,  83,  77,  25],
       [ 14,  43,  17,  18,  91],
       [ 59,  39,  87,  93,  25],
       [ 79,  30,  80,  78,  42],
       [ 91,  65,  39,  35,   5],
       [ 14,  69,  10,  57,  29],
       [ 76,  23,  14,  41,  59],
       [ 68,  75,  60,  18,  34],
       [ 41,  16,  90,  68,  47],
       [ 14,  88,  15,  90,  39],
       [ 50,  77,  30,  10,  43],
       [ 95,   6,  88,  81,  22],
       [ 46,  59,  15,  77,  15],
       [ 73,  78,  35,  88,  79],
       [ 12,  31,  39,  77,  67],
       [ 12,  57,  47,  35,  22],
       [ 32,  13,  28,  38,  78],
       [ 97,   5,   5,  69,  84],
       [ 49,  51,   9,   4,  54],
       [ 20,  73,  29,  61,  66],
       [ 30,  18,  13,  49,  64],
       [ 49,  61,  27,  46,  60],
       [ 79,  98,  49,  98,  24],
       [  3,  61,  69,   3,  90],
       [ 20,   9,  94,  31,  34],
       [ 83,  57,  13,  11,  23],
       [ 18,  18,   4,  13,  91],
       [ 38,  71,  53,   1,  99],
       [ 56,   5,   2,  52,  62],
       [ 48,  49,  84,  91,  41],
       [ 67,  54,  47,  17,  63],
       [ 45,  68,   7,  21,  47],
       [ 51,  71,  87,  60,   3],
       [ 74,  73,  39,  24,  12],
       [ 20,  56,  84,  43,  49],
       [ 49,  59,  42,  59,  90],
       [ 31,  33,  50,  73,  67],
       [ 99,  93,  75,  83,  15],
       [  8,  88,   5,  44,  86],
       [ 38,  93,  55,  22,   2],
       [ 94,  37,  82,  14,  90],
       [ 78,  40,  23,  10,  20],
       [ 50,  35,  58,   7,  64],
       [ 43,  30,  80,  54,   5],
       [ 97,  12,  40,  89,  19],
       [  7,  47,  92,  42,  31],
       [ 22,  92,  93,  98,  74],
       [  9,  35,   9,  75,  12],
       [ 89,  51,  57,  56,  50],
       [ 77,  45,  22,  78,   2],
       [ 52,  41,  40,   1,  32],
       [ 10,  39,  66,  14,  74],
       [ 58,  25,  16,  12,  60],
       [ 64,  86,  75,  17,  53],
       [ 70,  50,  22,  59,  76],
       [ 64,  24,  73,  57,  97],
       [  7,  58,  42,  11,  26],
       [ 72,  73,  35,  17,  16],
       [ 12,  34,  58,  37,  51],
       [ 76,  78,  83,  71,  33],
       [ 16,  92,  78,  93, 100],
       [ 97,  44,  47,  59,  46],
       [ 65,  88,  60,  95,  33],
       [ 92,  84,  61,  79,  51],
       [ 57,  57,   2,  18,  61],
       [ 45,  28,  62,  62,  62],
       [ 21,   4,  88,  87,  69],
       [  9,  93,  22,  21,  96],
       [ 63,   5,  20,  63,  49],
       [ 76,  29,  26,  50,  53],
       [ 87,  96,  52,  90,  97],
       [ 41,  57,  57,  68,  82],
       [ 41,  19,  83,  50,  16],
       [ 58,  24,  72,   3,  94],
       [ 10,  19,  65,  84,  90],
       [  4,  46,  97, 100,   4],
       [ 32,  71,   6,  24,  50],
       [ 82,  73,  84,  21,  46],
       [ 70,  96,  29,  87,  54],
       [ 43,  88,  24,   9,  77],
       [ 30,  80,  38,  63,  67],
       [ 67,  54,   4,  99,  29],
       [ 86,  86,  70,  46,  26],
       [ 58,  67,  19,  54,  27],
       [ 83, 100,  37,  28,  92],
       [ 76,  24,  34,  86,  30],
       [  8,  22,  85,  69,  17],
       [ 70,  38,  69,  68,  84],
       [ 74,  67,  75,  62,  54],
       [ 10,  15,   3,  85,  53],
       [ 54,  76,  28,   8,  20],
       [ 19,  74,  56,  49,  75],
       [ 22,   1,   2,   4,  70],
       [ 30,  46,  90,  42,  36],
       [ 94,  77,   4,  54,  13],
       [ 55,  83,  98,  72,  63],
       [ 75,  25,  31,  77,  64],
       [ 64,  69,  66,  96,  66],
       [ 93,  10,  11,  59,   1],
       [ 37,  51,  66,  80,  60],
       [ 80,  74,   1,  92,  91],
       [  8,  79,  95,  85,  41],
       [ 61,  52,  40,  75,  25],
       [ 36,  93,  35,  79,  33],
       [ 23,  24,   3,  84,  26],
       [ 27,  48,   6,  59,  31],
       [ 51,  61,  88,   9,  29],
       [ 29,  52,  72,  59,  62],
       [ 61,  94,  30,  57,  14],
       [ 92,  92,  81,  59,  81],
       [ 46,  23,  19,  69,  58],
       [ 86,  47,  59,  28,  85],
       [ 47,   6,  54,  25,  65],
       [ 42,  43,   6,  23,  18],
       [ 65,  67,  24,  60,  47],
       [ 16,  64,  35,   8,   3],
       [ 36,   8,  52,  37,  68],
       [ 35,  13,  43,   5,  62],
       [ 13,  57,  80,  45,  23],
       [ 95,  96,  26,  10,  53],
       [ 41,  93,  30,  82,   5],
       [ 44,  58,   7,  31,  14],
       [ 13,  22,  34,  74,  27],
       [ 42,  34,  43,  20,  37],
       [ 20,  59,  72,  35,  85],
       [ 46,  91,  61,  42,  48],
       [ 14,  41,  39,  94,  59],
       [ 70,  95,  83,  43,  31],
       [ 35,  11,   8,  12,  89],
       [  8, 100,  51,  24,  92],
       [ 21,  20,  98,  43,  54],
       [ 56,  10,  70,  56,  89],
       [ 35,  54,  43,  26,   7],
       [ 79,  46, 100,  31,  61],
       [ 59,  63,  63,  82,  44],
       [ 66,  42,  78,   1,  92],
       [ 71,  88,   4,   3,  67],
       [ 52,  16,  17,  95,  51],
       [ 61,   6,  60,  56,  20],
       [ 29,  88,  28,  46,  10],
       [ 92,  13,  37,  87,  44],
       [ 53,  32,  35,  53,  75],
       [ 94,  28,  67,  55,  87],
       [ 72,   3,  58,  74,  10],
       [ 58,  71,  18,  89,  72],
       [ 14,  87,   3,  79,  81],
       [ 17,  99,  87,   3,  94],
       [ 49,  31,  97,  70,  48],
       [ 63,  53,  86,  95,  79],
       [ 96,  86,  76,   3,  82],
       [ 41,  96,  95,  30,  24],
       [ 76,   7,  44,  68,  15],
       [ 91,  14,  19,  92,  47],
       [ 78,  29,  70,  51,  84],
       [ 66,  88,  40,   7,  75],
       [  5,  10,  72,  13,  15],
       [ 44,  87,  66,  31,  10],
       [ 28,  73,  72,  65,  75],
       [ 24,  76,  26,  95,  37],
       [ 81,   9,  26,  61,  42],
       [ 78,  75,  69,   7,  64],
       [ 67,  20,  41,   3,  26]])

In [55]:
sr2 = pd.Series([1,2,3], index=['a', 'b', 'c'])
sr2

a    1
b    2
c    3
dtype: int64

In [56]:
sr2['c']

3

In [7]:
df2 = pd.DataFrame([
    ['Tom', 28],
    ['Jerry', 31]
], columns=['Name', 'Age'])
df2

    Name  Age
0    Tom   28
1  Jerry   31

In [8]:
df2['City'] = ['Delhi', 'Mumbai']

In [9]:
df2

    Name  Age    City
0    Tom   28   Delhi
1  Jerry   31  Mumbai

In [10]:
df2.drop('Age', axis=1)

    Name    City
0    Tom   Delhi
1  Jerry  Mumbai

In [11]:
df2

    Name  Age    City
0    Tom   28   Delhi
1  Jerry   31  Mumbai

In [12]:
df2.drop('Age', axis=1, inplace=True)

In [13]:
df2

    Name    City
0    Tom   Delhi
1  Jerry  Mumbai

In [14]:
df2['FavFood'] = ['Idli', 'Dosa']

In [15]:
df2

    Name    City FavFood
0    Tom   Delhi    Idli
1  Jerry  Mumbai    Dosa

In [16]:
df2[['Name', 'FavFood']]

    Name FavFood
0    Tom    Idli
1  Jerry    Dosa

In [23]:
randomDf1.head()

    0    1   2   3   4
0  52  100  52  28  25
1  47   70   9  77  37
2  82   96  19  95  20
3  96   45  71  73  98
4  55   19  81  88  85

In [25]:
randomDf1.sort_index(axis = 1, ascending=False).head()

    4   3   2    1   0
0  25  28  52  100  52
1  37  77   9   70  47
2  20  95  19   96  82
3  98  73  71   45  96
4  85  88  81   19  55

In [27]:
randomDf1.sort_index(axis = 0, ascending=False).head()

      0   1   2   3   4
199  31  95  16   7  27
198  58  69  17   9  45
197  99  94  42  82  55
196  49  40  26  67  78
195  74  61  57  38  29

In [28]:
df2

    Name    City FavFood
0    Tom   Delhi    Idli
1  Jerry  Mumbai    Dosa

In [29]:
df2['Name']

0      Tom
1    Jerry
Name: Name, dtype: object

In [30]:
df2.columns = ['apple', 'banana', 'cat']

In [31]:
df2

   apple  banana   cat
0    Tom   Delhi  Idli
1  Jerry  Mumbai  Dosa

In [32]:
# how to get the value of idli ? [column][row]
df2['cat'][0]

'Idli'

In [33]:
df2['cat'][0] = 'sambar'

/var/folders/yv/_ddlvjkn6k11_jp7sl8jcy500000gn/T/ipykernel_89104/315203970.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df2['cat'][0] = 'sambar'

In [34]:
df2

   apple  banana     cat
0    Tom   Delhi  sambar
1  Jerry  Mumbai    Dosa

In [35]:
# [row, column]
df2.loc[0, 'cat']

'sambar'

In [36]:
df2.loc[0, 'cat'] = 'Upma'

In [37]:
df2

   apple  banana   cat
0    Tom   Delhi  Upma
1  Jerry  Mumbai  Dosa

In [38]:
# [row, column]
df2.iloc[1, 1]

'Mumbai'

In [39]:
# Iterate over df
df = pd.DataFrame(
    {
        'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [20, 30, 35]
    }
)

In [40]:
df

      Name  Age
0    Alice   20
1      Bob   30
2  Charlie   35

In [42]:
for index, row in df.iterrows():
    print(index)
    print(row)

0
Name    Alice
Age        20
Name: 0, dtype: object
1
Name    Bob
Age      30
Name: 1, dtype: object
2
Name    Charlie
Age          35
Name: 2, dtype: object

In [44]:
for index, row in df.iterrows():
    print(f"My roll no. : {index} and my name is {row['Name']} and I am {row['Age']} years old")

My roll no. : 0 and my name is Alice and I am 20 years old
My roll no. : 1 and my name is Bob and I am 30 years old
My roll no. : 2 and my name is Charlie and I am 35 years old

In [45]:
# RESHAPING

In [46]:
data = pd.DataFrame(
    {
        'Date': ['2025-02', '2025-02', '2025-03', '2025-03'],
        'City': ['Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
        'Temprature': [40, 35, 42, 30]
    }
)

In [47]:
data

      Date    City  Temprature
0  2025-02   Delhi          40
1  2025-02  Mumbai          35
2  2025-03   Delhi          42
3  2025-03  Mumbai          30

In [48]:
data.pivot(index='Date', columns='City', values='Temprature')

City     Delhi  Mumbai
Date
2025-02     40      35
2025-03     42      30

In [49]:
# Concat
df1 = pd.DataFrame({
    'A': ['A0', 'A1'],
    'B': ['B0', 'B1']
})

In [50]:
df2 = pd.DataFrame({
    'A': ['A2', 'A3'],
    'B': ['B2', 'B3']
})

In [51]:
df1

    A   B
0  A0  B0
1  A1  B1

In [52]:
df2

    A   B
0  A2  B2
1  A3  B3

In [53]:
pd.concat([df1, df2])

    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

In [54]:
pd.concat([df1, df2], axis = 1)

    A   B   A   B
0  A0  B0  A2  B2
1  A1  B1  A3  B3

In [56]:
# MERGE

In [57]:
left = pd.DataFrame(
    {
        'ID': [1,2],
        'Name': ['Alice', 'Bob']
    }
)

In [58]:
right = pd.DataFrame(
    {
        'ID': [1,2],
        'Score': [89, 92]
    }
)

In [59]:
pd.concat([left, right], axis=1)

   ID   Name  ID  Score
0   1  Alice   1     89
1   2    Bob   2     92

In [60]:
pd.merge(left, right, on='ID')

   ID   Name  Score
0   1  Alice     89
1   2    Bob     92

In [62]:
# GROUPING

In [63]:
df = pd.DataFrame({
    'Department': ['IT', 'HR', 'IT', 'HR'],
    'Employees': ['A', 'B', 'C', 'D'],
    'Salary': [60000, 50000, 65000, 52000]
})

In [64]:
df

  Department Employees  Salary
0         IT         A   60000
1         HR         B   50000
2         IT         C   65000
3         HR         D   52000

In [65]:
df.groupby('Department')['Salary'].mean()

Department
HR    51000.0
IT    62500.0
Name: Salary, dtype: float64

In [66]:
df.groupby('Department')['Salary'].sum()

Department
HR    102000
IT    125000
Name: Salary, dtype: int64

In [67]:
# Sorting

In [68]:
df= pd.DataFrame({
    'Name': ['Charlie', 'Alice', 'Bob'],
    'Age': [35, 25, 30]
})

In [69]:
df

      Name  Age
0  Charlie   35
1    Alice   25
2      Bob   30

In [72]:
df.sort_values(by=['Age', 'Salary'], ascending=True)

      Name  Age
1    Alice   25
2      Bob   30
0  Charlie   35